aaron-bond.better-comments
adam-bender.commit-message-editor
adashen.vscode-tomcat
adpyke.codesnap
alefragnani.bookmarks
alefragnani.project-manager
anseki.vscode-color
batisteo.vscode-django
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
cardinal90.multi-cursor-case-preserve
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chrmarti.regex
codeium.codeium
cweijan.dbclient-jdbc
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dgileadi.java-decompiler
docker.docker
donjayamanne.githistory
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotjoshjohnson.xml
dsznajder.es7-react-js-snippets
dzhavat.bracket-pair-toggler
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
georgewfraser.vscode-javac
github.copilot
github.copilot-chat
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
grapecity.gc-excelviewer
graphql.vscode-graphql
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hookyqr.beautify
humao.rest-client
ionutvmi.path-autocomplete
jakob101.relativepath
janisdd.vscode-edit-csv
johnpapa.vscode-peacock
kamikillerto.vscode-colorize
kevinrose.vsc-python-indent
lokalise.i18n-ally
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mhutchie.git-graph
mikestead.dotenv
mongodb.mongodb-vscode
monish.regexsnippets
mrmlnc.vscode-scss
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.js-debug-nightly
ms-vscode.remote-explorer
ms-vscode.vscode-typescript-next
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.vscode-react-native
mtxr.sqltools
natqe.reload
njpwerner.autodocstring
oderwat.indent-rainbow
oouo-diogo-perdigao.docthis
oracle.oracle-java
oracle.sql-developer
pflannery.vscode-versionlens
pkief.material-icon-theme
pleiades.java-extension-pack-jdk
pmneo.tsimporter
postman.postman-for-vscode
pranaygp.vscode-css-peek
pverest.java-ide-pack
rangav.vscode-thunder-client
redhat.java
redhat.vscode-community-server-connector
redhat.vscode-rsp-ui
redhat.vscode-xml
redhat.vscode-yaml
riazxrazor.html-to-jsx
ritwickdey.liveserver
rodrigovallades.es7-react-js-snippets
rvest.vs-code-prettier-eslint
sburg.vscode-javascript-booster
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
shengchen.vscode-checkstyle
sidthesloth.html5-boilerplate
sonarsource.sonarlint-vscode
steoates.autoimport
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
tomoki1207.pdf
usernamehw.errorlens
vaibhavacharya.code-gpt-va
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-lombok
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
waderyan.gitblame
walkme.java-extension-pack
wallabyjs.console-ninja
wallabyjs.quokka-vscode
whizkydee.material-palenight-theme
wholroyd.jinja
wix.vscode-import-cost
wscats.eno
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
youmaycallmev.vscode-java-saber
yusukehirao.vscode-markuplint
zainchen.json
zignd.html-css-class-completion
